DeviceNetworkEvents
| where TimeGenerated > ago (30d)
| where RemoteIP in ("31.42.4.138","31.135.199.145","46.112.70.252","46.248.185.236","64.176.67.117","64.176.69.196","64.176.70.18","64.176.70.238","64.176.71.201","70.34.242.220","70.34.243.226","70.34.244.100","70.34.245.215","70.34.252.168","70.34.252.186","70.34.252.222","70.34.253.13","70.34.253.247","70.34.254.245","79.184.25.198","79.185.5.142","83.10.46.174","83.23.130.49","83.29.138.115","83.168.66.145","83.168.78.27","83.168.78.31","83.168.78.55","89.64.70.69","90.156.4.204","91.149.202.215","91.149.203.73","91.149.219.23","91.149.219.158","91.149.223.130","91.149.253.20","91.149.253.118","91.149.253.198","91.149.253.204","91.149.254.75","91.149.255.19","91.149.255.122","91.149.255.195","91.221.88.76","93.105.185.139","95.215.76.209","103.97.203.29","109.95.151.207","138.199.59.43","147.135.209.245","162.210.194.2","178.37.97.243","178.235.191.182","185.234.235.69","192.162.174.67","192.162.174.94","194.187.180.20","207.244.71.84","209.14.71.127","212.127.78.170","213.134.184.167")
| sort by TimeGenerated desc 
